tdengines/xml/livesearchfr.xml

<!--
Copyright 2008 Olivier COUPELON
Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except in compliance with the License.
You may obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0
Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and limitations under the License.
 -->
<engine xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:noNamespaceSchemaLocation="teardrop_1_0.xsd">
	<name>Live Search France</name>
  <separator value="+" />
	<charset>UTF-8</charset>
  <terms>http://msdn.microsoft.com/library/en-us/MSN_Search_Web_Service_SDK/HTML/MSNWebSearchSDKLicenseAgreement.asp</terms>
	<header>Content-Type: text/xml</header>
	<query method="POST">
		<url>http://soap.search.msn.com/webservices.asmx</url>
		<inputfield><![CDATA[<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
		<soap:Body>
			<Search xmlns="http://schemas.microsoft.com/MSNSearch/2005/09/fex">
				<Request>
					<AppID>5E022975752699420875FD2D5C3E9B067731EB8A</AppID>
					<Query>%q</Query>
					<CultureInfo>fr-FR</CultureInfo>
					<SafeSearch>Off</SafeSearch>
					<Flags>None</Flags>
					<Requests>
						<SourceRequest>
							<Source>Web</Source>
							<Offset>0</Offset>
							<Count>10</Count>
							<ResultFields>Title Description Url</ResultFields>
						</SourceRequest>
					</Requests>
				</Request>
			</Search>
		</soap:Body>
	</soap:Envelope>]]></inputfield>
  </query>
  <result>
		<regexp>Title[^&gt;]*&gt;([^&lt;]*)&lt;.*?Description[^&gt;]*&gt;([^&lt;]*)&lt;.*?Url[^&gt;]*&gt;([^&lt;]*)&lt;</regexp>
		<field num="3" comparable="yes" name="url" />
		<field num="1" striphtml="yes" name="title" />
		<field num="2" striphtml="yes" name="abstract" />
  </result>
	<nextinput method="POST">
		<url>http://soap.search.msn.com/webservices.asmx</url>
		<inputfield num="1" name=""><![CDATA[<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
		<soap:Body>
			<Search xmlns="http://schemas.microsoft.com/MSNSearch/2005/09/fex">
				<Request>
					<AppID>5E022975752699420875FD2D5C3E9B067731EB8A</AppID>
					<Query>%q</Query>
					<CultureInfo>en-US</CultureInfo>
					<SafeSearch>Off</SafeSearch>
					<Flags>None</Flags>
					<Requests>
						<SourceRequest>
							<Source>Web</Source>
							<Offset>%n</Offset>
							<Count>10</Count>
							<ResultFields>Title Description Url</ResultFields>
						</SourceRequest>
					</Requests>
				</Request>
			</Search>
		</soap:Body>
	</soap:Envelope>]]></inputfield>
	</nextinput>
</engine>
